from aiogram import Bot

from config import HELLO_PICTURE_ID

# TODO: Full util rework
async def send_welcome_message(bot: Bot, chat_id: int, private_msg: bool = False):
    """Отправляет приветственное сообщение с описанием бота."""

    text = (
        "Я — Модя. Превращаю хаос флудов в порядок\n\n"
        "Вот что я умею:\n"
        "• 📣 Умный созыв участников\n"
        "• 📊 Управление чистками и подробная статистика\n"
        "• 🛡️ Система варнов и простая админ-панель\n"
        "• ⏸️ Полное управление рестами\n"
        "• ✨ И много других полезных функций\n\n"
        '<a href="https://teletype.in/@caportabow/ModyaTheBot">🔗 Полный список команд</a>'
    )

    await bot.send_photo(photo=HELLO_PICTURE_ID, caption=text, chat_id=chat_id, parse_mode="HTML")
