import asyncio
from aiogram import Bot, Dispatcher

from config import TELEGRAM_TOKEN
from handlers import routers
from middlewares import middlewares
import db
import scheduler

# DONE: 15 новых РП команд. Исправлен баг, когда вместо ника пользователя в боте отображался его ник в телеграмме. Рест теперь хранит информацию об администраторе, выдавшем рест и дате выдачи. Новая команда мой рест и рест {упоминание}, для просмотра подробной информации об ресте.
# TODO: возможность добавлять собственные рп команды +Мрп [название] / [эмодзи] / [текст действия]. Например: +мрп показать язык /😛/ показал язык.
# TODO: инфа, кто, выбери 
# TODO: utils.texts для заготовок для форматирования хренотеней
# TODO: обновленные цитаты: новая команда -- /qs чтобы добавить любой стик в список группы. Новая команда -- /qd, чтобы удалить цитату из списка группы

dp = Dispatcher()
bot = Bot(token=TELEGRAM_TOKEN)


async def main():
    # регистрируем роутеры и мидлвари
    for router in routers:
        dp.include_router(router)
    for middleware in middlewares:
        dp.message.middleware(middleware)

    await db.init_db()
    scheduler.start(bot)
    try:
        print("🤖 Bot started...")
        await dp.start_polling(bot,
                    allowed_updates=dp.resolve_used_update_types(),
        )
    finally:
        await db.close_db()

if __name__ == "__main__":
    asyncio.run(main())
