import asyncio
from aiogram import Bot, Dispatcher

from config import TELEGRAM_TOKEN
from handlers import routers
from middlewares import middlewares
import db
import scheduler

# TODO: На команде 'кто [я|ты]' график активности имеет баги визуалиации(см. даты) (bug_report.jpg)
# TODO: Модульность. Возможность отключить отдельные модули. Например РП команды или цитаты.

# TODO: Переработать /start и /help команды
# TODO: Кэшировать ответы чисток чтобы приделать кнопку типо выдать варны
# TODO: Обновить собственные РП команды чтобы разделять через ньюлайн, а не через слэши
# TODO: Смена/Установка пола (.мойпол м/ж) -- потом использовать это в РП и прочих командах
# TODO: 15 личных РП команд на чат вместо 3-х
# TODO: Возможность просмотреть личные РП команды
# TODO: Возможность экспортировать список РП команд в другой чат
# TODO: Игнор-лист для РП/или прочих команд
# TODO: Рестники не должны участвовать в созыве
# TODO: новые рп команды:
"""
отлизать👅 → {user} отлизал(а) у {target}
кусь 💢 → {user} укусил(а) {target}
пнуть 👞 → {user} пнул(а) поджопника {target}
пощекотать 🙌 → {user} пощекотал(а) {target}
залезть 👙 → {user} залез(ла) в трусики к {target}
сесть 😈 → {user} сел(а) на лицо {target}
лап 🫴 → {user} полапал(а) {target} за интимные места
уебать 💥 → {user} уебал(а) {target}
вмазать 🥊 → {user} вмазал(а) {target}
втащить 🥊 → {user} втащил(а) {target}
толкнуть 🫳 → {user} толкнул(а) {target}
швырнуть 💫 → {user} швырнул(а) {target}
флиртовать 😏 → {user} флиртует с {target}
раздеть 👗 → {user} страстно сорвал(а) одежду с {target}
отыметь 😈💦 → {user} отымел(а) {target} как последнюю сучку
вылизать 👅💦 → {user} вылизал(а) {target} до последней капли
пожать руку 🤝 → {user} крепко пожал(а) руку {target}
дать пять 🖐 → {user} дал(а) пять {target}
поклониться 🙇 → {user} уважительно поклонился(а) {target}
успокоить 🤲 → {user} нежно успокоил(а) {target}
""" 

dp = Dispatcher()
bot = Bot(token=TELEGRAM_TOKEN)


async def main():
    # регистрируем роутеры и мидлвари
    for router in routers:
        dp.include_router(router)
    for middleware in middlewares:
        dp.message.middleware(middleware)

    await db.init_db()
    scheduler.start(bot)
    try:
        print("🤖 Bot started...")
        await dp.start_polling(bot,
                    allowed_updates=dp.resolve_used_update_types(),
        )
    finally:
        await db.close_db()

if __name__ == "__main__":
    asyncio.run(main())
