import asyncio
from aiogram import Bot, Dispatcher

from config import TELEGRAM_TOKEN
from routers import routers
from middlewares import middlewares
import db
import scheduler

# TODO: сделать текст интерфейса более единым
# TODO: check_adoption_possibility и check_marriage_loyality под полный реворк
# TODO: ввести лог последних действий админов на неделю +-
# TODO: если во время тех обслуживания кто-то выйдет из чата или модю удалят из группы, бот не отреагирует на это
# TODO: хандлить конверсию в супергруппу
# TODO: Сейчас бот не подходит для топиков/форумов
# TODO: слишком длинные ники + тг ники не обновляются по мере изменения их в тг
# TODO: возможность задать, спустя какое время рестники будут участвовать в чистке
# TODO: хранить раз в сколько недель делать чистку (авточистка)
# TODO: возможность сохранить роль участника +роль, а потом выводить в кто я/ты или при выходе ++++ предлагать сделать калл после установки роли
# TODO: Если настроена авточистка можно рассчитывать сколько соо будет к проверке нормы
# TODO: Отказаться от datetime в пользу времени в ДБ
# TODO: Переработать /start и /help команды
# TODO: Модульность. Возможность отключить отдельные модули. Например РП команды или цитаты.

dp = Dispatcher()
bot = Bot(token=TELEGRAM_TOKEN)


async def main():
    # регистрируем роутеры и мидлвари
    for router in routers:
        dp.include_router(router)
    for middleware in middlewares:
        dp.message.middleware(middleware)

    await db.init_db()
    scheduler.start(bot)
    try:
        print("🤖 Bot started...")
        await dp.start_polling(bot,
                    allowed_updates=dp.resolve_used_update_types(),
        )
    finally:
        await db.close_db()

if __name__ == "__main__":
    asyncio.run(main())
