import asyncio
from aiogram import Bot, Dispatcher

from config import TELEGRAM_TOKEN
from routers import routers
from middlewares import middlewares
import db
from services import scheduler

# Баги/срочное:
# TODO: сделать команду чтобы попросить удочерить/усыновить себя
# TODO: "собраться" тоже начинает созыв
# TODO: калл не работает с caption
# TODO: возможность отписаться от созыва
# TODO: рестники не должны учавствовать в созывах
# TODO: возможность указать причину реста
# TODO: подтверждение для развода и подобного
# TODO: создать подписку на изменения в чате для админов https://chatgpt.com/share/6971d294-ad78-8010-bacf-42b744451650
# TODO: хандлить конверсию в супергруппу
# TODO: сделать текст интерфейса более единым ++ сделать нормальные докстринги везде
# TODO: Команда -чат
# TODO: возможность задать, спустя какое время рестники будут участвовать в чистке
# TODO: Если настроена авточистка можно рассчитывать сколько соо будет к проверке нормы
# TODO: возможность сохранить роль участника +роль, а потом выводить в кто я/ты или при выходе ++++ предлагать сделать калл после установки роли
# TODO: Переработать /start и /help команды (/help -> команда "команды" с инлайн клавиатурой ++ возможность посмотреть команды через инлайн запрос)
# TODO: родители одиночки
# TODO: слишком длинные ники + тг ники не обновляются по мере изменения их в тг
# TODO: Отказаться от datetime в пользу времени в ДБ
# TODO: Модульность. Возможность отключить отдельные модули. Например РП команды или цитаты.

dp = Dispatcher()
bot = Bot(token=TELEGRAM_TOKEN)


async def main():
    # регистрируем роутеры и мидлвари
    for router in routers:
        dp.include_router(router)
    for middleware in middlewares:
        dp.message.middleware(middleware)

    await db.init_db()
    scheduler.start(bot)
    try:
        print("🤖 Bot started...")
        await dp.start_polling(bot,
                    allowed_updates=dp.resolve_used_update_types(),
        )
    finally:
        await db.close_db()

if __name__ == "__main__":
    asyncio.run(main())
